[{"id":1,"first_name":"1.Telebler:","last_name":"Tələblərin müəyyənləşdirilməsi,sistemin ehtiyac duyduğu yüksək səviyyəli biznes tələblərini, gərəkli biznes dəyərlərinə çevirmək üçün yerinə yetirilir.Tələblərin siyahısı isə analiz mərhələsinin müxtəlif fəaliyyətləri ilə müəyyənləşdirilir, dəstəklənir, təsdiqlənir və izah edilir.Tələb sadə olaraq sistemin nə etməli olduğu və onun hansı xüsusiyyətlərə sahib olmalı olduğunu izah edən bir halıdır. Sistem inkişaf etdirmə layihələrində tələblər bir neçə qrupa bölünür.Bunlar biznes ehtiyaclarını izah edən biznes tələbləri, istifadəçilərin olmasına ehtiyac duyduğu istifadəçi tələbləri, sistem software-nin yerinə yetirməli olduğu funksional tələblər, sistemin sahib olmalı olduğu xüsusiyyətləri izah edən qeyri-funksional tələblər və sistemin necə qurulmalı olduğunu izah edən sistem tələbləridir.Analiz mərhələsində tələbləri müəyyənləşdirə bilmək üçün həm biznes həm də İT yöndən analizlərə ehtiyac duyulur. Bəzən sistem analitikləri biznes tələblərini düzgün anlamaya bilərlər. Bəzən də biznes istifadəçiləri yeni sistemin yaratdığı fürsətlərdən tam olaraq xəbərdar olmaya bilərlər. Yeni sistemi quran heyət mövcud biznes proseslərini və bu biznes proseslərini məlumat sistemləri texnologiyaları ilə necə gücləndirmək lazım olduğunu hər zaman nəzərə almalı və öncəlik olaraq qəbul etməlidir.Tələblərin analiz edilməsi üçün bir neçə strategiya var:Problem analizi; Əsas səbəb analizi; Müddət analizi; Fəaliyyət-əsaslı xərcləndirmə; Qeyri-rəsmi müqayisə; Nəticə analizi;"},
{"id":2,"first_name":"2.Is plani:","last_name":"Layihə idarəçisi və ya idarəçiləri layihənin ölçüsü və təxmini zaman qrafiki haqqında ümumi təsəvvürə sahib olduqdan sonra iş planı hazırlayır. İş planı layihə ərzində yerinə yetirilməli olan bütün tapşırıqların izləndiyi və üzərində tapşırıqların qeydinin aparıldığı dinamik bir cədvəldir. Layihə idarəçisi iş planını qura bilmək üçün ilk olaraq yerinə yetirilməli olan hər bir tapşırığın vacib xüsusiyyətlərini bir yerə cəmləşdirməli və onun əsasında iş planı hazırlamalıdır. İş planının təşkili zamanı idarəçi yerinə yetirilməli bütün tapşırıqları və onların nə qədər zaman alacağını müəyyənləşdirir."},
{"id":3,"first_name":"3.Timeboxing:","last_name":"İndiyə qədər biz layihələrə tapşırıq əsaslı olaraq baxmışıq. Bir başqa sözlə layihələrə müəyyən zamanda yerinə yetirilməli tapşırıqların toplusu olaraq nəzər salmışıq. Bu da, o deməkdir ki, tələblər və tapşırıqlar hər nə qədər çox olarsa layihə bir o qədər uzun çəkəcək. Lakin təəssüf ki, bir çox şirkət bu qədər uzun çəkən inkişaf layihələrinə qarşı olduqca az səbirlidirlər. Bu tip şirkətlər hər zaman layihələrə zaman əsaslı baxırlar və onlar üçün başlanğıcda hər zaman yerinə yetirilməli tapşırıqlar və yeniliklərdən daha çox layihənin zamanı maraqlı olur. Buna görə də şirkətlər yeni qurulacaq sistemin müəyyən funksiyalarını bir an öncə görmək istəyirlər. Məhz bu nüans layihələri zaman baxımından sürətli olmağa məcbur edən ən önəmli nüanslardandır. Bu zaman nöqteyi-nəzərdən məhdudiyyətlər mütəxəsisləri fərqli bir iş strategiyası formalaşdırmağa məcbur etmişdir. Bu strategiya demək olar ki, bütün sistem inkişaf etdirmə və qurma layihələrində fikir verilən əsas və izlənilən ilkin strategiyadır. Burada deyilir ki, sistemin funksionallığının 75%-i mümkün qədər tez bir zamanda ortaya qoyula bilər.Geri qalan 25%-lik funksiyalar isə daha sonradan nisbətən uzun zaman ərzində tamamlanmalıdır. Bunun üçün isə tez bir zamanda yerinə yetirilə biləcək funksiyalar düzgün müəyyənləşdirilməlidir. Geri qalan 25%-lik bir hissə əksər hallarda estetik, istifadəçi yönümlü və.s. özəllikləri əhatə edir.Bu strategiya öz növbəsində zaman limitləndirmə olaraq da bilinir.Zaman limitləndirmənin tətbiqi addımları:1. Sistemin təhvil veriləcəyi zamanı təyin etmək; 2. Sistemdə nəzərə alınmalı əsas funksiyaları vaciblik nöqteyi-nəzərdən sıralamaq; 3. Özək sistemi qurmaq (funksiyalar öncəlik olaraq sıralanaraq); 4. Verilən zaman çərçivəsində təmin edilə bilməyəcək funksiyaları təxirə salmaq; 5. Özək təşkil edəcək funksilara sahib sistemi təhvil vermək; 6. Addım 3-dən 5-ə doğru prosesi təkrarlamaq və bu zaman ərzində gərəkli yaxşılaşdırma və inkişaf etdirmə sayəsində sistemi təkmilləşdirmək.6-cı addım sistem tam olaraq təhvil verilənə qədər davam etdirilir."},
{"id":4,"first_name":"4.Mumkunluk:","last_name":"Mümkünlük analizi layihənin davam edib etməməyinə qərar verə bilmək üçün bələdçi rolunu oynayır və layihəni hərtərəfli analiz edir. Mümkünlük analizi həmçinin layihə təsdiqlənəcəyi halda onun bütün risklərinin də mümkün qədər müəyyənləşdirilməsi prosesini də özündə ehtiva edir. Sistem istəyi verildikdən sonra demək olar ki, hər müəssisənin öz daxili proseduruna uyğun mümkünlük analizi və prosesi vardır, lakin bu analizlər əsas üç fəaliyyət sahəsi üzrə yerinə yetirilir: texniki mümkünlük, iqtisadi mümkünlük və şirkətiçi mümkünlük."},
{"id":5,"first_name":"5.Iqtisadi mumkunluyu:","last_name":"Mümkünlük analizi layihənin davam edib etməməyinə qərar verə bilmək üçün bələdçi rolunu oynayır və layihəni hərtərəfli analiz edir. Mümkünlük analizi həmçinin layihə təsdiqlənəcəyi halda onun bütün risklərinin də mümkün qədər müəyyənləşdirilməsi prosesini də özündə ehtiva edir. Sistem istəyi verildikdən sonra demək olar ki hər müəssisənin öz daxili proseduruna uyğun mümkünlük analizi və prosesi vardır, lakin bu analizlər əsas üç fəaliyyət sahəsi üzrə yerinə yetirilir: texniki mümkünlük, iqtisadi mümkünlük və şirkətiçi mümkünlük. İqtisadi mümkünlük. Bu analiz çox zaman xərc-mənfəət analizi olaraq da adlandırılır. Bu analiz ‘Biz bu sistemi qurmalıyıqmı?’ sualına cavab tapmaq üçün yerinə yetirilir. İqtisadi mümkünlük analizi sistemin xərc və gəlirini, dəyərlərini müəyyənləşdirməkdən, gələcək pul dövriyyəsini hesablamaqdan və layihənin maliyyə dəyərini ölçməkdən ibarətdir. Bu analiz sayəsində layihənin maliyyə imkanları və riskləri tam olaraq anlaşıla bilir. Nəzərə də almaq lazımdır ki, müəssisələrin limitli maliyyə resursu olur və müəssisələr hər zaman bu resursları hansı layihələrə yatıracağına daha düzgün qərar verməyə çalışır. Məhz, buna görə də iqtisadi mümkünlük layihəyə pul yatırıb yatırmamağa qərar vermək üçün olduqca əhəmiyyətli bir analizdir."},
{"id":6,"first_name":"13.Teskilati mumkunluyu:","last_name":"Mümkünlük analizi layihənin davam edib etməməyinə qərar verə bilmək üçün bələdçi rolunu oynayır və layihəni hərtərəfli analiz edir. Mümkünlük analizi həmçinin layihə təsdiqlənəcəyi halda onun bütün risklərinin də mümkün qədər müəyyənləşdirilməsi prosesini də özündə ehtiva edir. Sistem istəyi verildikdən sonra demək olar ki hər müəssisənin öz daxili proseduruna uyğun mümkünlük analizi və prosesi vardır, lakin bu analizlər əsas üç fəaliyyət sahəsi üzrə yerinə yetirilir: texniki mümkünlük, iqtisadi mümkünlük və şirkətiçi mümkünlük. Şirkətiçi mümkünlük. Son texnika şirkətiçi mümkünlük analizidir ki, burada istifadəçilərin sistemə necə reaksiya verəcəyi, şirkət strukturunun sistem ilə uyğunluğu, sistemi şirkətə tam adaptasiya etməyin mümkünlüyü analiz edilir. Şirkətiçi mümkünlük analizi ‘Əgər biz bu sistemi qursaq, şirkət onu işlədə biləcəkmi?’ sualına cavab tapmaq üçün yerinə yetirilir."},
{"id":7,"first_name":"8.Textiki Fizibilite:","last_name":"Mümkünlük analizi layihənin davam edib etməməyinə qərar verə bilmək üçün bələdçi rolunu oynayır və layihəni hərtərəfli analiz edir. Mümkünlük analizi həmçinin layihə təsdiqlənəcəyi halda onun bütün risklərinin də mümkün qədər müəyyənləşdirilməsi prosesini də özündə ehtiva edir. Sistem istəyi verildikdən sonra demək olar ki hər müəssisənin öz daxili proseduruna uyğun mümkünlük analizi və prosesi vardır, lakin bu analizlər əsas üç fəaliyyət sahəsi üzrə yerinə yetirilir: texniki mümkünlük, iqtisadi mümkünlük və şirkətiçi mümkünlük. Texniki mümkünlük. Mümkünlük analizinin ilk texnikası texniki mümkünlük analizidir. Burada İT qrupu tərəfindən sistemin dizayn, inkişaf etdirilə və quraşdırıla biləcəyinə əmin olmaq üçün fəaliyyətlər yerinə yetirilir. Texniki mümkünlük analizi əsas mahiyyəti ilə ‘Biz bu sistemi qura bilərikmi?’ sualına cavab tapmaqdan ibarətdir və texniki risk analizi olaraq da adlandırılır."},
{"id":8,"first_name":"6.Analiz merhelesi:","last_name":"Analiz mərhələsində analizçilər yeni qurulacaq sistemin funksional tələblərini müəyyənləşdirir. Analiz mərhələsinin əsas sənədlərindən biri sistem təklifi adlı sənəddir. Burada tələb anlayışı izah edilir və tələblər müəyyən kateporiyalarda qruplaşdırılır. Tələbləri düzgün olaraq aşkarlama texnikaları bu mərhələnin başlanğıcında geniş müzakirə olunur. Analiz mərhələsində yerinə yetirilən əsas iş sistem istəyi sənədindəki baxış açısını daha da genişləndirərək yeni sistemin ehtiyaclarını dəqiq olaraq anlamaq və izah etməkdən ibarətdir.Analiz mərhələsi (qısacası analiz özü) bir bütünü onu təşkil edən elementlərin təbiəti, funksiyaları, qarşılıqlı əlaqəsi və s. xüsusiyyətlərini daha yaxşı anlaya bilmək üçün elementlərinə parçalamaq və onları detaylı incələmək prosesindən ibarətdir. Planlama mərhələsində formalaşan sənədlər (sistem istəyi, mümkünlük analizi və layihə planı) yeni sistemin biznes hədəflərini müəyyənləşdirmək, layihənin əhatə dairəsini bəlli etmək, layihəni mümkünlük nöqteyi-nəzərdən qiymətləndirmək və ilkin iş planını təmin etmək üçün olduqca əhəmiyyətli sənədlərdir. Məhz elə bu sənədlər də analiz mərhələsinin başlanğıcın əsaslanılan ən mühüm sənədlərdir. Analiz mərhələsində sistem analitikləri biznes istifadəçilərinin yeni sistemə olan ehtiyaclarını və tələblərini daha dolğun anlaya bilmək üçün onlarla intensiv işləməyə məcburdurlar.Əsas analiz prosesi üç addımdan ibarətdir: Mövcud vəziyyəti anlamaq; İnkişaf imkanlarını müəyyənləşdirmək; Yeni sistemə olan tələbləri aşkarlamaq.Bəzən ilk addım yerinə yetirilmir və ya limitli şəkildə yerinə yetirilir. Bu əksər hallarda köhnə sistem mövcud olmayan hallarda, yəni sistem sıfırdan qurulan zaman, baş verir.Analiz və dizayn mərhələləri arasındakı cizgi olduqca qarışıq və bulanıqdır. Belədir ki analiz mərhələsinin bəzi son addımları və ya prosesləri dizayn mərhələsinin ilk addımları ilə üst-üstə düşür. Yeni sistem üçün düşünülən əsas dizayn qərarlarının bir çoxu analiz mərhələsi sənədlərində və ya qərarlarında öz əksini tapır. Heç şübhəsiz ki, məhz buna görə çox zaman analiz mərhələsini “analiz və ilkin dizayn” mərhələsi olaraq da adlandırırlar. Sadəcə bu ad nisbətən uzun olduğu üçün çox müəssisə və mütəxəssis bu mərhələni analiz olaraq adlandırır."},
{"id":9,"first_name":"7.DFD-nin 4 qaydasi:(deqiq bilmirem bu olub olmadigini)","last_name":"MAD yerinə yetiriləcək bir işin bütün fəaliyyət və proseslərini xəritələndirərək onları daha anlaşıqlı etmək prosesidir. MAD qurma prosesində bir neçə ana qaydalar vardır. Bu qaydalar və MAD-i formalaşdıran əsas elementlər haqqında məlumat verək. MAD-də 4 əsas element var ki, onların da hər biri fərqli görsəl simbolla əks etdirilir. Bu elementlər proseslər, məlumat axışı, məlumat deposu və kənar məfhumlardır (varlıqlardır)."},
{"id":10,"first_name":"8.Axin qrafiki qaydaları","last_name":"MAD formalaşdıran zaman nəzərə alınmalı bir neçə qayda var ki, bu qaydalarla sizi tanış etmək istəyirəm. 1.Məlumatlar hər hansı bir proses tərəfindən işlənmək üçün prosesə doğru hərəkət etmədiyi təqdirdə heç bir dəyişikliyə məruz qalmır və gözləmə vəziyyətini saxlayır. 2.Proseslər məlumatları sıfırdan yarada bilməz və ya məlumatlar proses daxilində yoxa çıxa bilməz. Proseslər sadəcə və sadəcə məlumatları bir haldan digər hala dəyişmək üçün yerinə yetirilir. 3.Məlumatlar iki məfhum arasında birbaşa dövr edə bilməz. Bunun baş verməsi o deməkdir ki, həmin kənar məfhumlar bir-biri ilə əlaqədədir, lakin analiz etdiyimiz sistemlə əlaqədə deyildir. Belə olan halda bu əlaqənin MAD daxilində əks etdirilməsi heç bir məna kəsb etmir və məfhumlar arası əlaqə proses modellərində deyil, məlumat modellərində analiz edilir. 4.Məlumatlar axışı iki məlumat bazası arasında birbaşa dövr edə bilməz. Əgər belə hadisə baş vermişsə, bu, o deməkdir ki, məlumat heç bir dəyişikliyə məruz qalmadan bir bazadan digər bazaya transfer edilir. Bu da əlavə prosedur və sənədləşmə deməkdir. Məlumat sistemlərinin optimallaşdırılması isə bu hadisənin baş verməməsini tələb edir. 5.Proseslər məlumatları bir formadan digər bir formaya dəyişməyə məcburdur. 6.Məlumat axışları heç bir halda bir-biri ilə kəsişə bilməz. Bu qayda ortaya çıxa biləcək qarışıqlıqları ortadan qaldırmaq üçün olduqca vacibdir. Bu qaydanı qoruya bilmək üçün MAD daxilində əlaqələndirmə simvollarından istifadə edilir. Bu əlaqələndirmə səhifəiçi və ya səhifəkənarı əlaqələndirmə ola bilər. 7.Proseslər ən azı bir məlumat girişinə və bir məlumat çıxışına sahib olmalıdır. 8.Məlumat axışı birbaşa kənar məfhumdan məlumat bazasına və məlumat bazasından kənar məfhuma ötürülə bilməz. 9.Məlumat axışı sadəcə proseslərdən keçərək ötürülə bilər. Bu qaydanı məlumat axışı ən azından ya başlanğıcda, ya da sonda prosesə bağlı olmalıdır deyə də anlaya bilərik. 10.Məlumat axışı prosesi tərk etdikdən sonra prosesdən kənar, yəni ötürülmə prosesində dəyişikliyə məruz qala bilməz. Sadəcə proseslər məlumatları dəyişmə gücünə malikdir. 11.Məlumat axışı bir prosesi tərk etdikdən sonra eyni prosesə başqa proseslərdən keçmədən birbaşa geri dönə bilməz. Bu məlumat sistemlərinin optimallaşdırılması nöqteyi-nəzərdən vacib bir nüansdır."},
{"id":11,"first_name":"9.Ehate dairesinin surusmesi","last_name":"Siz düşünə bilərsiniz ki sizin hazırlayacağınız layihə zamanlama problemlərindən tam azad olacaq, çünki siz hər bir şeyi öncədən diqqətli ölçmüş və planlamısınız. Lakin demək olar ki bütün layihələrdə zamanla zamanlama və xərc problemləri ortaya çıxır. Buna layihənin əhatə dairəsindən yayınma (bundan sonra qısaca yayınma adlandırılacaq) deyilir.Yayınma layihə əhatə dairəsinin ilkin olaraq müəyyənləşdirilməsi və sabit olaraq qəbul edilməsindən sonra layihəyə yeni tələblər əlavə edildikdə ortaya çıxır. Bu bir çox səbəbdən ortaya çıxa bilər. İstifadəçilərin yeni sistemi daha yaxşı anladıqca və tanıdıqca onun əlavə funksiyalarından istifadə etmək istəyi, sistemi inkişaf etdirən mütəxəsislərin sistemin istifadə edilə bilən və daha effektli yönlərini kəşf etməsi, layihə rəhbərinin yeni bir strategiyanın tətbiq edilməsinə tapşırıq verməsi və s. kimi hadisələr bu səbələrdən sayıla bilər.Təəssüflər olsun ki layihələrə start verildikdən sonra yenilənən tələblərin sistem qurma layihəsində nəzərə alınması çətin hala gəlir. Xüsusilə də layihənin sonuna bu çətinlik daha da artmağa davam edir. Dəyişikliklərdəki şaxələnmə və budaqlanmalar zamanla daha da geniş hal alır və bu da öz növbəsində ilkin hədəflərdən yayınmaya, xərcə və zaman limitinə müəyyən təsirlərə gətirib çıxarır. Əgər layihənin başından sistem quran mütəxəsislər davamlı olaraq istifadəçilər ilə toplantılar keçirərsə, müəyyən prototiplərdən istifadə edərək toplanmış “istifadəçi təcrübəsi”-ndən düzgün istifadə edərsə sonradan daha az dəyişikliklər edərək layihəni davam etdirmək və daha uğurla və planlandığı kimi sonlandırmaq mümkündür."},
{"id":12,"first_name":"10.Riskin qiymetlendirilmesi","last_name":"Layihə idarəetmənin ən son müzakirə olunacaq yönü risklərin idarə olunmasıdır. Bunu layihənin inkişafında ortaya çıxa biləcək risklərin dəyərləndirilməsi və onlara qarşı uyğun tədbirlərin görülməsi prosesi olaraq da qəbul edə bilərik. Layihələrdə bir çox ünsür risklərə səbəb ola bilər; zəif personal, əhatə dairəsindən yayınma, kasad dizayn, həddən artıq optimist hesablamalar və.s. kimi nüanslar buna misal ola bilər. Komanda risklər haqqında məlumatlandırılmalıdır ki, yalnız bu yolla onlardan qaçıla və risklər nəzarətdə saxlana bilər. Layihə komandaları xüsusi bir risk qiymətləndirmə sənədi və ya şablonu hazırlayır ki, burada risklərin ortaya çıxma ehtimalı və onların potensial təsirləri öz əksini tapmalıdır. Risklər mümkün qədər detaylı incələnir və onlar haqqında geniş məlumat burada öz əksini tapır. Riskin ortaya çıxma səbəbindən asılı olaraq onlara fərqli-fərqli metodlarla yanaşmaq olar: onları ictimailəşdirərək mövcudluğunu ərtafa duyurmaq və onlara qarşı diqqətli olunmağa çalışmaq (bu heç bir yolla nəzarətə alına bilməyəcək risklərə qarşı tədbir ola bilər), risklərdən yayınmaq və ya onları tamamilə aradan qaldırmaq."},
{"id":13,"first_name":"11.Kadr plani:","last_name":"Layihə heyətinin qurulması prosesi layihəyə təyin edilməli olan işçi sayının müəyyənləşdirilməsi, işçi heyətinin bacarıqlarının layihənin ehtiyaclarına uyğunlaşdırılması, heyəti layihənin məqsədlərinə uyğun işləyə bilmək üçün motivasiya etmək, zamanla heyət daxilində ortaya çıxacaq konfliktləri minimuma endirmək və.s. fəaliyyətlərin toplamından ibarətdir. Bu prosesin nəticəsi layihə heyətinin planı sənədinin hazırlanmasıdır. Bu sənəd layihədə neçə və hansı keyfiyyətlərə cavab verən işçi heyətinin işləməli olduğu, məruzəetmə strukturunun necə təşkil olunduğu və layihə nizamnaməsini (nizamnamə layihənin məqsəd və qayda-qanunlarını əks etdirir) özündə ehtiva edir. Effektivlikdə itkiyə düçar olmamağın bir yolu da heyət sayının yaratdığı mürəkkəbliyin doğru analiz edilərək nəzərə alınması və bunun əsasında üzvlərin bir-biri ilə əlaqəsinin nizamlanması məqsədi ilə məruzəetmə strukturunun yaradılmasıdır. Layihə işlərində hər zaman açar fəaliyyət komandaların tərkibinin 8-10 arası olaraq nizamlanmasıdır. Daha artıq sayda işçi olarsa alt komandaların təşkili daha məntiqə uyğundur. Beləcə, idarəçilər komandalarla onların liderləri sayəsində daha effektiv əlaqə qura bilər və onların işi haqqında daha mükəmməl məlumatlana bilər."},
{"id":14,"first_name":"12.Istifade Case","last_name":"İstifadə halları müştərilər və müştərilərin tapşırıqlarını və işini yerinə yetirəcək sistem arasında qarşılıqlı fəaliyytələri izah edir və bu fəaliyyətləri sənədləşdirir. İstifadə halları sistemi inkişaf etdirən heyətə müştərilərin hədəflərini daha yaxşı qarşılaya bilmək üçün tam olaraq hansı addımlar və prosesləri yetinə yetirmək lazım olduğunu daha dolğun anlatmaq üçün qurulur. İstifadə halları formalaşdırıldığı andan onlar yeni sistem üçün daha detallı funksional tələbləri ortaya çıxarmağa yardım edir. İstifadə hallarının fromalaşdırılması zamanı izlənilən bir neçə addım var ki onlar bu addımlardır: 1.Sistemin bütün istifadəçiləri müəyyənləşdirilir və hər biri üçün istifadəçi profili hazırlanır. 2.Müəyyən bir istifadəçi seçilir və onun hədəfləri tam müəyyənləşdirilir. 3.Sistem daxilində bu hədəflərə çata bilmək üçün hansı istiqamətli fəaliyyətlərin yerinə yetiməli olduğu izah edilir. 4.Bütün alternativ fəaliyyət istiqamətləri nəzərə alınır və İstifadə halları genişləndirilir. 5.İstifadəçilərin bütün ortaq fəaliyyət istiqamətləri müəyyənləşdirilərək hər bir hədəfə uyğun ortaq bir istifadə halları formalaşdırılır. 6.2-5-ci addımlar bu istifadəçilər üçün təkrarlanır. Qeyd: burada bütün istifadəçilər deyildikdə tək-tək hər biri deyildə, fərqli fərqli xüsusiyyətlər ortaya qoyan bütün növ istifadəçi qrupları nəzərdə tutulur və burada məqsəd hər növ istifadəçinin hədəflərini anlaya bilməkdir. Ənənəvi ehtiyacların seçilməsi texnikaları yalnız istifadəçilərdən onların sistemlərdən olan gözlənti və istəklərini soruşmaqla bu ehtiyacları doğru anlamağın mümkün olacağını vurğulayır. Sistem analitikləri məcburən istifadəçilər ilə bir masa arxasında oturaraq proses və məlumat modelləri hazırlama sayəsində sistemlərin nələr etməli olduğunu ifadə etməyə çalışırlar. Bu istifadəçilər üçün bəzi səbəblərə görə problemlər yaradır. Birincisi istifadəçilər sistemdə nəyisə etməyin mümkün olub-olmadığını tam olaraq bilməyə bilərlər. İstifadəçilərin texnoloji sistemlərin bütün imkanlarından xəbərdar olmaması gözlənilən bir haldır. İkincisi, istifadəçilər daha əvvəl gördükləri işləri yeni metodlarla yerinə yetirmək lazım olduğunu təsəvvür etməyə bilərlər. Köhnə metodlara bağlılıq göstərə bilərlər. Üçüncü və ən önəmlisi isə istifadəçilər sistemə olan ehtiyaclarını tam olaraq vurğulamaya bilərlər və ya onların vurğuladığı ehtiyaclar real ehtiyaclar olmaya bilər."},
{"id":15,"first_name":"14.Sistem sorgulari","last_name":"Yoxdur1"},
{"id":16,"first_name":"15.Model Prosesi","last_name":"Yoxdur"}]